In [5]:
%load_ext sql

In [14]:
%%sql sqlite:///student_db

In [16]:
%%sql PRAGMA SQL_SAFE_UPDATES =0;

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
Done.

[]

In [17]:
%%sql CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
Done.

[]

In [20]:
%%sql SELECT * FROM personal_details;

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male'),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female'),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male'),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female'),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male'),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female'),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male'),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female'),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male'),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female'),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male'),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female'),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male'),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male'),
 (390234, 'stud115', 'Deamon Anduro', '0744421123', 22, 'Female')]

In [19]:
%%sql INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
15 rows affected.

[]

In [21]:
%%sql CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
Done.

[]

In [22]:
%%sql INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
15 rows affected.

[]

In [26]:
%%sql UPDATE school_details
SET stud_email = (SELECT (REPLACE (stud_name,' ','') ,'@zinduaschool.ac')
					FROM personal_details
					WHERE school_details.stud_ID = personal_details.stud_ID) ;

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
(sqlite3.OperationalError) row value misused
[SQL: UPDATE school_details
SET stud_email = (SELECT (REPLACE (stud_name,' ','') ,'@zinduaschool.ac')
					FROM personal_details
					WHERE school_details.stud_ID = personal_details.stud_ID) ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [27]:
%%sql CREATE VIEW new_stud_details AS
SELECT
student_name,
school_id,
email,
phone_number
FROM students s
JOIN schools sch ON s.school_id = sch.school_id;

   sqlite:///Zindua.db
   sqlite:///Zindua.sql
 * sqlite:///student_db
Done.

[]